app/controllers/articles_controller.rb

  def index
    @articles = Article.all
---
SELECT * FROM `articles`

  def show
    @article = Article.find(params[:id])
---
SELECT * FROM `articles` WHERE (`articles`.`id` = 1)

  def new
    @article = Article.new

    @circoli_a = Array.new
    @circoli =  Society.find(:all)
    @circoli.each do |c|
---
SELECT * FROM `societies`

  def edit
    @article = Article.find(params[:id])
    @circoli_a = Array.new
    @circoli =  Society.find(:all)
    @circoli.each do |c|
    	@circoli_a << c.society
    end
    if request.post?
#   	render :text => params[:article].inspect
    	unless params[:article][:photo].nil?
		  	@article.photo = params[:article][:photo]
		  	@article.save!
---
SELECT * FROM `articles` WHERE (`articles`.`id` = 1)
SELECT `societies`.id FROM `societies` WHERE (`societies`.`society` = BINARY 'Colonnata') LIMIT 1
SELECT * FROM `societies`
INSERT INTO `societies` (`opening_time`, `created_at`, `president`, `updated_at`, `tel`, `society`, `base`, `email`) VALUES('', '2011-01-27 13:42:49', NULL, '2011-01-27 13:42:49', '0554487659', 'Colonnata', '<p>VIA GINORI,50 - 50019 SESTO FIORENTINO (FI) </p>', 'colonnata@aclifirenze.it')
UPDATE `articles` SET `updated_at` = '2011-01-05 14:09:20', `photo_file_name` = 'DSCN5531.JPG', `photo_file_size` = 1093800, `photo_content_type` = 'image/jpeg' WHERE `id` = 1

  def create
    @article = Article.new(params[:article])
    respond_to do |format|
      if @article.save
---
INSERT INTO `articles` (`created_at`, `title`, `updated_at`, `date`, `description`, `image`, `society`) VALUES('2010-11-26 16:48:10', 'Pranzo del socio', '2010-11-26 16:48:10', '2010-12-10 00:00:00', 'Pranzo djevlgjvyjvgjugjgjtgjvg pbeopsùciùbùbùùbùb\r\n\r\nbb\r\nb\r\nb\r\n15€', '', 'Colonnata')

  def update
    @article = Article.find(params[:id])

    respond_to do |format|
      if @article.update_attributes(params[:article])
---
SELECT * FROM `articles` WHERE (`articles`.`id` = 1)
UPDATE `articles` SET `updated_at` = '2011-02-15 11:16:05', `photo_file_name` = 'DSCN5536.JPG', `title` = 'culoculoculo', `photo_file_size` = 1030996 WHERE `id` = 1

  def destroy
    @article = Article.find(params[:id])
    @article.destroy
---
SELECT * FROM `articles` WHERE (`articles`.`id` = 2)
DELETE FROM `articles` WHERE `id` = 2