app/controllers/home_controller.rb

	def index
		@reportsprovinciali = Report.find_all_by_society("Acliprovinciale")
		@articlescircoli = Article.find(:all, :order => "date")
		@articlescircoli.each do |article|
---
SELECT * FROM `articles` ORDER BY date