app/controllers/home_controller.rb

SELECT * FROM `reports` WHERE (`reports`.`society` = 'Acliprovinciale')
SELECT * FROM `articles` WHERE (date >= '2011-02-15 18:04:23' ) ORDER BY date LIMIT 10
---
	def index
		@reportsprovinciali = Report.find_all_by_society("Acliprovinciale")
		@articlescircoli = Article.find(:all, :conditions => ['date >= ? ', Time.now], :order => :date, :limit => 10)