app/controllers/reports_controller.rb

  def index
    @reports = Report.all
---
SELECT * FROM `reports`

  def show
    @report = Report.find(params[:id])
---
SELECT * FROM `reports` WHERE (`reports`.`id` = 1)

  def new
    @report = Report.new

		@circoli_a = Array.new
    @circoli =  Society.find(:all)
    @circoli.each do |c|
---
SELECT * FROM `societies`

  def edit

    @report = Report.find(params[:id])
    @circoli_a = Array.new
    @circoli =  Society.find(:all)
    @circoli.each do |c|
---
SELECT * FROM `reports` WHERE (`reports`.`id` = 1)
SELECT * FROM `societies`

  def create
    @report = Report.new(params[:report])

    respond_to do |format|
      if @report.save
---
INSERT INTO `reports` (`created_at`, `title`, `updated_at`, `description`, `society`) VALUES('2011-02-11 21:45:00', NULL, '2011-02-11 21:45:00', NULL, NULL)

  def destroy
    @report = Report.find(params[:id])
    @report.destroy
---
SELECT * FROM `reports` WHERE (`reports`.`id` = 1)
DELETE FROM `reports` WHERE `id` = 1