app/controllers/societies_controller.rb

  def index
    @societies = Society.all
---
SELECT * FROM `societies`

  def show
    @society = Society.find(params[:id])
---
SELECT * FROM `societies` WHERE (`societies`.`id` = 1)

  def edit
    @society = Society.find(params[:id])
---
SELECT * FROM `societies` WHERE (`societies`.`id` = 1)

  def create
    @society = Society.new(params[:society])

    respond_to do |format|
      if @society.save
---
INSERT INTO `societies` (`opening_time`, `created_at`, `updated_at`, `tel`, `society`, `base`, `email`) VALUES('', '2010-11-26 16:16:11', '2010-11-26 16:16:11', '0554487659', 'colonnata', 'VIA GINORI,50 - 50019 SESTO FIORENTINO (FI)', 'colonnata@aclifirenze.it')

  def update
    @society = Society.find(params[:id])

    respond_to do |format|
      if @society.update_attributes(params[:society])
---
SELECT `societies`.id FROM `societies` WHERE (`societies`.`society` = BINARY 'Colonnata' AND `societies`.id <> 1) LIMIT 1
UPDATE `societies` SET `updated_at` = '2010-12-29 17:59:28', `base` = 'VIA GINORI,50 - 50019 SESTO FIORENTINO (FI)' WHERE `id` = 1