app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` IS NULL) LIMIT 1

  def new
    @user = User.new
	@circoli_a = Array.new
    @circoli =  Society.find(:all)
    @circoli.each do |c|
---
SELECT * FROM `societies`

  def edit
    @user = User.find(params[:id])
    @circoli_a = Array.new
    @circoli =  Society.find(:all)
    @circoli.each do |c|
---
SELECT * FROM `users` WHERE (`users`.`id` IS NULL) LIMIT 1
SELECT * FROM `societies`

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`name`, `created_at`, `updated_at`, `hashed_password`, `admin`, `nikname`, `surname`, `society`) VALUES('pollo', '2010-12-29 15:11:02', '2010-12-29 15:11:02', '0db6b74aff6927acbd0bfba05c6602cc525dc540', 1, 'pollo', 'pollo', 'Colonnata')

  def update
    @user = User.find(params[:id])
    #controllo di non togliere il permesso di amministrazione all' ultimo admin
		unless User.find_by_admin(true).to_a.count == 1 and @user.admin? then
			respond_to do |format|
		  	if @user.update_attributes(params[:user]) then
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
SELECT * FROM `users` WHERE (`users`.`admin` = 1) LIMIT 1
UPDATE `users` SET `updated_at` = '2010-12-29 15:06:19', `name` = 'Niccolò', `surname` = 'Paladino', `nikname` = 'nikkopala', `hashed_password` = '25119c0fa481581bdd7cf5e19805bd72a0415bc6' WHERE `id` = 1

  def destroy
  	unless User.find_by_admin(true).to_a.count == 1
    	@user = User.find(params[:id])
    	@user.destroy
---
SELECT * FROM `users` WHERE (`users`.`id` = 2) LIMIT 1
DELETE FROM `users` WHERE `id` = 5